-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 22, 2025 at 10:58 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `skjacth_pa_evaluation`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_rubric_items`
--

CREATE TABLE `tb_rubric_items` (
  `ri_id` varchar(50) NOT NULL COMMENT 'รหัสหัวข้อการประเมิน',
  `ri_part` int(11) NOT NULL COMMENT 'ส่วนของการประเมิน (1 หรือ 2)',
  `ri_domain` varchar(255) DEFAULT NULL COMMENT 'หมวดหมู่ของงาน (เช่น ด้านการจัดการเรียนรู้)',
  `ri_item_number` varchar(10) DEFAULT NULL COMMENT 'ลำดับหัวข้อ (เช่น 1.1, 2.3)',
  `ri_item_description` text DEFAULT NULL COMMENT 'รายละเอียดลักษณะงานที่ปฏิบัติ',
  `ri_expected_level_description` text DEFAULT NULL COMMENT 'คำอธิบายระดับการปฏิบัติที่คาดหวัง',
  `ri_academic_standing` varchar(100) DEFAULT NULL COMMENT 'วิทยฐานะที่ใช้ (ถ้ามี)',
  `ri_position` varchar(40) NOT NULL COMMENT 'ตำแหน่งผู้ประเมิน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tb_rubric_items`
--

INSERT INTO `tb_rubric_items` (`ri_id`, `ri_part`, `ri_domain`, `ri_item_number`, `ri_item_description`, `ri_expected_level_description`, `ri_academic_standing`, `ri_position`) VALUES
('ri68caa1a43791b', 1, '1.ด้านการจัดการเรียนรู้', '1.1', 'สร้างและหรือพัฒนาหลักสูตร', 'การจัดทำรายวิชาและหน่วยการเรียนรู้ ให้สอดคล้องกับมาตรฐานการเรียนรู้ และตัวชี้วัดหรือผลการเรียนรู้ ตามหลักสูตรเพื่อให้ผู้เรียนได้พัฒนาสมรรถนะและการเรียนรู้ เต็มตามศักยภาพ โดยมีการปรับประยุกต์ให้สอดคล้องกับบริบทของสถานศึกษา ผู้เรียน และท้องถิ่น', 'ไม่มีวิทยฐานะ', 'ครู'),
('ri68caa4db89793', 1, '1.ด้านการจัดการเรียนรู้', '1.2', 'ออกแบบการจัดการเรียนรู้', 'เน้นผู้เรียนเป็นสำคัญ เพื่อให้ผู้เรียนมีความรู้ ทักษะ คุณลักษณะประจำวิชา คุณลักษณะ  อันพึงประสงค์ และสมรรถนะที่สำคัญ ตามหลักสูตร โดยมีการปรับประยุกต์ให้สอดคล้องกับบริบท      ของสถานศึกษา ผู้เรียน และท้องถิ่น', 'ไม่มีวิทยฐานะ', ''),
('ri68caab17ad4ea', 1, '1.ด้านการจัดการเรียนรู้', '1.4', 'สร้างและหรือพัฒนาสื่อ นวัตกรรม เทคโนโลยี   และแหล่งเรียนรู้ ', 'มีการสร้างและหรือพัฒนาสื่อ นวัตกรรม เทคโนโลยีและแหล่งเรียนรู้สอดคล้องกับกิจกรรมการเรียนรู้ โดยมีการปรับประยุกต์ให้สอดคล้องกับความแตกต่าง      ของผู้เรียน และทำให้ผู้เรียนมีทักษะการคิดและสามารถสร้างนวัตกรรมได้', 'ไม่มีวิทยฐานะ', ''),
('ri68caab3f7cba9', 1, '1.ด้านการจัดการเรียนรู้', '1.5', 'วัดและประเมินผลการเรียนรู้', 'มีการวัดและประเมินผลการเรียนรู้ด้วยวิธีการ  ที่หลากหลาย เหมาะสม และสอดคล้องกับมาตรฐาน การเรียนรู้ ให้ผู้เรียนพัฒนาการเรียนรู้อย่างต่อเนื่อง', 'ไม่มีวิทยฐานะ', ''),
('ri68caab8b6aa92', 1, '1.ด้านการจัดการเรียนรู้', '1.6', 'ศึกษา วิเคราะห์ และสังเคราะห์ เพื่อแก้ปัญหาหรือพัฒนาการเรียนรู้', 'มีการศึกษา วิเคราะห์ และสังเคราะห์ เพื่อแก้ปัญหาหรือพัฒนาการเรียนรู้ที่ส่งผลต่อคุณภาพผู้เรียน', 'ไม่มีวิทยฐานะ', ''),
('ri68caae020ab7c', 1, '1.ด้านการจัดการเรียนรู้', '1.8', 'อบรมและพัฒนาคุณลักษณะที่ดีของผู้เรียน', 'มีการอบรมบ่มนิสัยให้ผู้เรียนมีคุณธรรม จริยธรรม คุณลักษณะอันพึงประสงค์ และค่านิยมความเป็นไทยที่ดีงาม', 'ไม่มีวิทยฐานะ', ''),
('ri68caae9124210', 1, '1.ด้านการจัดการเรียนรู้', '1.7', 'จัดบรรยากาศที่ส่งเสริมและพัฒนาผู้เรียน', 'มีการจัดบรรยากาศที่ส่งเสริมและพัฒนาผู้เรียนให้เกิดกระบวนการคิด ทักษะชีวิต ทักษะการทำงาน ทักษะการเรียนรู้และนวัตกรรม ทักษะด้านสารสนเทศ สื่อ และเทคโนโลยี', 'ไม่มีวิทยฐานะ', ''),
('ri68caaeee70c4b', 1, '1.ด้านการจัดการเรียนรู้', '1.3', 'จัดกิจกรรมการเรียนรู้', 'มีการอำนวยความสะดวกในการเรียนรู้และส่งเสริมผู้เรียนได้พัฒนาเต็มตามศักยภาพ เรียนรู้และทำงานร่วมกัน โดยมีการปรับประยุกต์ให้สอดคล้องกับความแตกต่างของผู้เรียน', 'ไม่มีวิทยฐานะ', ''),
('ri68cab2806113e', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.1', 'จัดทำข้อมูลสารสนเทศของผู้เรียนและรายวิชา', 'มีการจัดทำข้อมูลสารสนเทศของผู้เรียนและรายวิชาเพื่อใช้ในการส่งเสริมสนับสนุนการเรียนรู้และพัฒนาคุณภาพผู้เรียน', 'ไม่มีวิทยฐานะ', ''),
('ri68cb7c0c399a1', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.2', 'ดำเนินการตามระบบดูแลช่วยเหลือผู้เรียน ', 'มีการใช้ข้อมูลสารสนเทศเกี่ยวกับผู้เรียนรายบุคคล และประสานความร่วมมือกับผู้มีส่วนเกี่ยวข้อง เพื่อพัฒนา และแก้ปัญหาผู้เรียน', 'ไม่มีวิทยฐานะ', ''),
('ri68cb7d447f7fe', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.3', 'ปฏิบัติงานวิชาการ และงานอื่นๆ ของสถานศึกษา ', 'ร่วมปฏิบัติงานทางวิชาการ และงานอื่น ๆ   ของสถานศึกษาเพื่อยกระดับคุณภาพการจัดการศึกษาของสถานศึกษา ', 'ไม่มีวิทยฐานะ', ''),
('ri68cb7f63f1a2b', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.4', 'ประสานความร่วมมือกับผู้ปกครอง ภาคีเครือข่าย และหรือสถานประกอบการ ', 'ประสานความร่วมมือกับผู้ปกครอง ภาคีเครือข่าย และหรือสถานประกอบการ เพื่อร่วมกันพัฒนาผู้เรียน', 'ไม่มีวิทยฐานะ', ''),
('ri68cb7fad49b3f', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.1', 'พัฒนาตนเองอย่างเป็นระบบและต่อเนื่อง เพื่อให้มีความรู้ความสามารถ ทักษะ โดยเฉพาะอย่างยิ่งการใช้ภาษาไทยและภาษาอังกฤษเพื่อการสื่อสาร และการใช้เทคโนโลยีดิจิทัล เพื่อการศึกษาสมรรถนะวิชาชีพครูและความรอบรู้ในเนื้อหาวิชาและวิธีการสอน', '', 'ไม่มีวิทยฐานะ', ''),
('ri68cb7ff81f63b', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.2', 'มีส่วนร่วมในการแลกเปลี่ยนเรียนรู้ทางวิชาชีพ     เพื่อพัฒนาการจัดการเรียนรู้', '', 'ไม่มีวิทยฐานะ', ''),
('ri68cb801bb1e39', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.3', 'นำความรู้ ความสามารถ ทักษะที่ได้จากการพัฒนาตนเองและวิชาชีพมาใช้ในการพัฒนาการจัดการเรียนรู้ การพัฒนาคุณภาพผู้เรียน และการพัฒนานวัตกรรมการจัดการเรียนรู้', '', 'ไม่มีวิทยฐานะ', ''),
('ri68cb8b959524e', 2, '1. วิธีดำเนินการ (20 คะแนน)', '1.1', 'พิจารณาจากการดำเนินการที่ถูกต้อง ครบถ้วน เป็นไปตามระยะเวลาที่กำหนดไว้ในข้อตกลง และสะท้อนให้เห็นถึงระดับการปฏิบัติที่คาดหวังตามตำแหน่งและวิทยฐานะ', '', NULL, ''),
('ri68cb8bd793967', 2, '2. ผลลัพธ์การเรียนรู้ของผู้เรียนที่คาดหวัง  (20 คะแนน)', '2.1', 'เชิงปริมาณ (10 คะแนน)', 'พิจารณาจากการบรรลุเป้าหมายเชิงปริมาณได้ครบถ้วนตามข้อตกลง และมีความถูกต้อง เชื่อถือได้', NULL, ''),
('ri68cb8bf0824f2', 2, '2. ผลลัพธ์การเรียนรู้ของผู้เรียนที่คาดหวัง  (20 คะแนน)', '2.2', 'เชิงคุณภาพ (10 คะแนน)', 'พิจารณาจากการบรรลุเป้าหมายเชิงคุณภาพได้ครบถ้วน ถูกต้อง เชื่อถือได้และปรากฏผลต่อคุณภาพผู้เรียนได้ตามข้อตกลง', NULL, ''),
('ri68cbdbea734bb', 1, '1. ด้านการจัดการเรียนรู้', '1.1', 'สร้างและหรือพัฒนาหลักสูตร', 'มีการจัดทำรายวิชาและหน่วยการเรียนรู้   ให้สอดคล้องกับมาตรฐานการเรียนรู้ และตัวชี้วัดหรือ    ผลการเรียนรู้ตามหลักสูตรเพื่อให้ผู้เรียนได้พัฒนาสมรรถนะและการเรียนรู้ เต็มตามศักยภาพ โดยมีการพัฒนารายวิชาและหน่วยการเรียนรู้ ให้สอดคล้องกับบริบทของสถานศึกษา ผู้เรียน และท้องถิ่น และสามารถแก้ไขปัญหาในการจัดการเรียนรู้ได้', 'ชำนาญการ', ''),
('ri68cbdc1d6fa45', 1, '1. ด้านการจัดการเรียนรู้', '1.2', 'ออกแบบการจัดการเรียนรู้', 'เน้นผู้เรียนเป็นสำคัญ เพื่อให้ผู้เรียนมีความรู้ ทักษะ คุณลักษณะประจำวิชา คุณลักษณะอันพึงประสงค์ และสมรรถนะที่สำคัญ ตามหลักสูตร โดยมีการออกแบบการจัดการเรียนรู้ ที่สามารถแก้ไขปัญหาในการจัดการเรียนรู้ ทำให้ผู้เรียนมีกระบวนการคิดและค้นพบ   องค์ความรู้ด้วยตนเอง และสร้างแรงบันดาลใจ', 'ชำนาญการ', ''),
('ri68cbdc3788ea3', 1, '1. ด้านการจัดการเรียนรู้', '1.3', 'จัดกิจกรรมการเรียนรู้', 'มีการอำนวยความสะดวกในการเรียนรู้ และส่งเสริมผู้เรียนได้พัฒนาเต็มตามศักยภาพ เรียนรู้และทำงานร่วมกันโดยมีการจัดกิจกรรมการเรียนรู้ ที่สามารถแก้ไขปัญหาในการจัดการเรียนรู้ ทำให้ผู้เรียน  มีกระบวนการคิดและค้นพบองค์ความรู้ด้วยตนเอง และสร้างแรงบันดาลใจ', 'ชำนาญการ', ''),
('ri68cbdc502f5c6', 1, '1. ด้านการจัดการเรียนรู้', '1.4', 'สร้างและหรือพัฒนาสื่อ นวัตกรรม เทคโนโลยีและแหล่งเรียนรู้ ', 'มีการสร้างและหรือพัฒนาสื่อ นวัตกรรม เทคโนโลยีและแหล่งเรียนรู้สอดคล้องกับกิจกรรมการเรียนรู้ สามารถ แก้ไขปัญหาในการเรียนรู้ของผู้เรียน และทำให้ผู้เรียนมีทักษะการคิดและสามารถสร้างนวัตกรรมได้', 'ชำนาญการ', ''),
('ri68cbdc66db9bc', 1, '1. ด้านการจัดการเรียนรู้', '1.5', 'วัดและประเมินผลการเรียนรู้', 'มีการวัดและประเมินผลการเรียนรู้ด้วยวิธีการ  ที่หลากหลาย เหมาะสม และสอดคล้องกับมาตรฐาน  การเรียนรู้ ให้ผู้เรียนพัฒนาการเรียนรู้อย่างต่อเนื่อง ประเมินผลการเรียนรู้ ตามสภาพจริง และนำผลการวัดและประเมินผลการเรียนรู้ มาใช้แก้ไขปัญหาการจัด   การเรียนรู้', 'ชำนาญการ', ''),
('ri68cbdc7ac5451', 1, '1. ด้านการจัดการเรียนรู้', '1.6', 'ศึกษา วิเคราะห์ และสังเคราะห์ เพื่อแก้ปัญหาหรือพัฒนาการเรียนรู้', 'มีการศึกษา วิเคราะห์ และสังเคราะห์ เพื่อแก้ไขปัญหา หรือพัฒนาการเรียนรู้ที่ส่งผลต่อคุณภาพผู้เรียนและนำผลการศึกษา วิเคราะห์ และสังเคราะห์ มาใช้แก้ไขปัญหาหรือพัฒนาการจัดการเรียนรู้', 'ชำนาญการ', ''),
('ri68cbdc8ea563c', 1, '1. ด้านการจัดการเรียนรู้', '1.7', 'จัดบรรยากาศที่ส่งเสริมและพัฒนาผู้เรียน', 'มีการจัดบรรยากาศที่เหมาะสม สอดคล้องกับความแตกต่างผู้เรียนเป็นรายบุคคล สามาร แก้ไขปัญหาการเรียนรู้ สร้างแรงบันดาลใจ ส่งเสริม และพัฒนาผู้เรียนให้เกิดกระบวนการคิด ทักษะชีวิต ทักษะการทำงาน ทักษะการเรียนรู้ และนวัตกรรม ทักษะด้านสารสนเทศ สื่อ และเทคโนโลยี', 'ชำนาญการ', ''),
('ri68cbdca31dfeb', 1, '1. ด้านการจัดการเรียนรู้', '1.8', 'อบรมและพัฒนาคุณลักษณะที่ดีของผู้เรียน', 'มีการอบรมบ่มนิสัยให้ผู้เรียนมีคุณธรรม จริยธรรม คุณลักษณะอันพึงประสงค์ และค่านิยมความเป็นไทยที่ดีงาม โดยคำนึงความแตกต่างของผู้เรียนเป็นรายบุคคล และสามารแก้ไขปัญหาผู้เรียนได้', 'ชำนาญการ', ''),
('ri68cbdce69074d', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.1', 'จัดทำข้อมูลสารสนเทศของผู้เรียนและรายวิชา', 'มีการจัดทำข้อมูลสารสนเทศของผู้เรียนและรายวิชา โดยมีข้อมูลเป็นปัจจุบัน เพื่อใช้ในการส่งเสริมสนับสนุนการเรียนรู้ แก้ไขปัญหาและพัฒนาคุณภาพผู้เรียน', 'ชำนาญการ', ''),
('ri68cbdcfa60b6a', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.2', 'ดำเนินการตามระบบดูแลช่วยเหลือผู้เรียน', 'มีการใช้ข้อมูลสารสนเทศเกี่ยวกับผู้เรียนรายบุคคล และประสานความร่วมมือกับผู้มีส่วนเกี่ยวข้อง เพื่อพัฒนาและแก้ไขปัญหาผู้เรียน', 'ชำนาญการ', ''),
('ri68cbdd0e3273c', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.3', 'ปฏิบัติงานวิชาการ และงานอื่น ๆ ของสถานศึกษา', 'ร่วมปฏิบัติงานทางวิชาการ และงานอื่น ๆ ของสถานศึกษาเพื่อยกระดับคุณภาพการจัดการศึกษาของสถานศึกษา ', 'ชำนาญการ', ''),
('ri68cbdd25dd62c', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.4', 'ประสานความร่วมมือกับผู้ปกครอง ภาคีเครือข่าย และหรือสถานประกอบการ', 'ประสานความร่วมมือกับผู้ปกครอง ภาคีเครือข่าย และหรือสถานประกอบการ เพื่อร่วมกันแก้ไขปัญหาและพัฒนาผู้เรียน', 'ชำนาญการ', ''),
('ri68cbdd411c08b', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.1', 'พัฒนาตนเองอย่างเป็นระบบและต่อเนื่อง', 'มีการพัฒนาตนเองอย่างเป็นระบบและต่อเนื่อง เพื่อให้มีความรู้ ความสามารถ ทักษะ โดยเฉพาะอย่างยิ่งการใช้ภาษาไทยและภาษาอังกฤษเพื่อการสื่อสาร และการใช้เทคโนโลยีดิจิทัลเพื่อการศึกษา สมรรถนะวิชาชีพครูและความรอบรู้ในเนื้อหาวิชาและวิธีการสอน และนำผลการพัฒนาตนเองและพัฒนาวิชาชีพมาใช้ในการจัดการเรียนรู้ที่มีผลต่อคุณภาพผู้เรียน', 'ชำนาญการ', ''),
('ri68cbdd5106a4a', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.2', 'มีส่วนร่วมในการแลกเปลี่ยนเรียนรู้ทางวิชาชีพ   เพื่อแก้ไขปัญหาและพัฒนาการจัดการเรียนรู้', '', 'ชำนาญการ', ''),
('ri68cbdd639b6cc', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.3', 'นำความรู้ ความสามารถ ทักษะที่ได้จากการพัฒนาตนเองและวิชาชีพมาใช้ในการพัฒนาการจัดการเรียนรู้ การพัฒนาคุณภาพผู้เรียน และการพัฒนานวัตกรรมการจัดการเรียนรู้ ที่มีผลต่อคุณภาพผู้เรียน', '', 'ชำนาญการ', ''),
('ri68cbddce7fede', 1, '1. ด้านการจัดการเรียนรู้', '1.1', 'สร้างและหรือพัฒนาหลักสูตร', 'ริเริ่ม พัฒนารายวิชาและหน่วยการเรียนรู้ให้สอดคล้องกับมาตรฐานการเรียนรู้ และตัวชี้วัด หรือผลการเรียนรู้ ตามหลักสูตร บริบทของสถานศึกษา ผู้เรียน และท้องถิ่น สามารถแก้ไขปัญหาในการจัดการเรียนรู้ เพื่อให้ผู้เรียนได้พัฒนาสมรรนะและ     การเรียนรู้เต็มตามศักยภาพส่งผลให้คุณภาพการจัดการเรียนรู้สูงขึ้น และเป็นแบบอย่างที่ดี ในการสร้างและหรือพัฒนาหลักสูตร', 'ชำนาญการพิเศษ', ''),
('ri68cbddecb051a', 1, '1. ด้านการจัดการเรียนรู้', '1.2', 'ออกแบบการจัดการเรียนรู้', 'ริเริ่ม คิดค้น การออกแบบการจัดการเรียนรู้ โดยเน้นผู้เรียนเป็นสำคัญ สามารถแก้ไขปัญหา และพัฒนาคุณภาพ   การจัดการเรียนรู้ให้สูงขึ้น เพื่อให้ผู้เรียน มีความรู้ ทักษะ คุณลักษณะประจำวิชา คุณลักษณะ อันพึงประสงค์ และสมรรถนะที่สำคัญ ตามหลักสูตร มีกระบวนการคิดและค้นพบองค์ความรู้ด้วยตนเอง และสร้างแรงบันดาลใจ และเป็นแบบอย่างที่ดีในการออกแบบการจัดการเรียนรู้', 'ชำนาญการพิเศษ', ''),
('ri68cbde067f391', 1, '1. ด้านการจัดการเรียนรู้', '1.3', 'จัดกิจกรรมการเรียนรู้', 'มีการริเริ่ม คิดค้น และพัฒนานวัตกรรม การจัดกิจกรรมการเรียนรู้ ที่สามารถแก้ไขปัญหาในการจัดการเรียนรู้ ทำให้ผู้เรียนได้พัฒนาเต็มตามศักยภาพ เรียนรู้และทำงานร่วมกัน       มีกระบวนการคิดและค้นพบองค์ความรู้ด้วยตนเองและสร้าง    แรงบันดาลใจและเป็นแบบอย่างที่ดีในการจัดกิจกรรมการเรียนรู้', 'ชำนาญการพิเศษ', ''),
('ri68cbde1e7a091', 1, '1. ด้านการจัดการเรียนรู้', '1.4', 'สร้างและหรือพัฒนาสื่อ นวัตกรรม เทคโนโลยีและ แหล่งเรียนรู้ ', 'มีการริเริ่ม คิดค้น และพัฒนาสื่อ นวัตกรรม เทคโนโลยีและแหล่งเรียนรู้สอดคล้องกับกิจกรรมการเรียนรู้ สามารถแก้ไขปัญหาในการเรียนรู้ของผู้เรียน และทำให้ผู้เรียนมีทักษะการคิดและสามารถสร้างนวัตกรรมได้และเป็นแบบอย่างที่ดีในการสร้างและหรือพัฒนาสื่อ นวัตกรรม เทคโนโลยีและแหล่งเรียนรู้', 'ชำนาญการพิเศษ', ''),
('ri68cbde326d520', 1, '1. ด้านการจัดการเรียนรู้', '1.5', 'วัดและประเมินผลการเรียนรู้', 'มีการริเริ่ม คิดค้น และพัฒนารูปแบบการวัดและประเมินผลการเรียนรู้ตามสภาพจริง ด้วยวิธีการที่หลากหลายเหมาะสม และสอดคล้องกับมาตรฐานการเรียนรู้ และนำผล    การวัดและประเมินผลการเรียนรู้ มาใช้แก้ไขปัญหาการจัดการเรียนรู้เพื่อให้ผู้เรียนพัฒนาการเรียนรู้อย่างต่อเนื่อง และ        เป็นแบบอย่างที่ดีในการวัดและประเมินผลการเรียนรู้', 'ชำนาญการพิเศษ', ''),
('ri68cbde4334eaa', 1, '1. ด้านการจัดการเรียนรู้', '1.6', 'ศึกษา วิเคราะห์ และสังเคราะห์ เพื่อแก้ไขปัญหาหรือพัฒนาการเรียนรู้', 'มีการริเริ่ม คิดค้น วิเคราะห์ และสังเคราะห์ เพื่อแก้ไขปัญหาหรือพัฒนาการเรียนรู้ที่ส่งผลต่อคุณภาพผู้เรียนและนำผลการศึกษาวิเคราะห์ และสังเคราะห์ มาใช้แก้ไขปัญหาหรือพัฒนาคุณภาพการจัดการเรียนรู้ให้สูงขึ้น และเป็นแบบอย่างที่ดี        ในการศึกษา วิเคราะห์ และสังเคราะห์ เพื่อแก้ไขปัญหาหรือพัฒนาการเรียนรู้', 'ชำนาญการพิเศษ', ''),
('ri68cbde5cd124d', 1, '1. ด้านการจัดการเรียนรู้', '1.7', 'จัดบรรยากาศที่ส่งเสริมและพัฒนาผู้เรียน', 'มีการริเริ่ม คิดค้น และพัฒนาการจัดบรรยากาศ  ที่เหมาะสม สอดคล้องกับความแตกต่างผู้เรียนเป็นรายบุคคล สามารถแก้ไขปัญหาการเรียนรู้ และสร้างแรงบันดาลใจส่งเสริมและพัฒนาผู้เรียนให้เกิดกระบวนการคิด ทักษะชีวิต ทักษะการทำงาน ทักษะการเรียนรู้และนวัตกรรม ทักษะด้านสารสนเทศ   สื่อ และเทคโนโลยีและเป็นแบบอย่างที่ดีในการจัดบรรยากาศ ที่ส่งเสริมและพัฒนาผู้เรียนเรียนรู้และนวัตกรรม ทักษะด้านสารสนเทศ สื่อ และเทคโนโลยี', 'ชำนาญการพิเศษ', ''),
('ri68cbde711f432', 1, '1. ด้านการจัดการเรียนรู้', '1.8', 'อบรมและพัฒนาคุณลักษณะที่ดีของผู้เรียน', 'มีการอบรมบ่มนิสัยให้ผู้เรียนมีคุณธรรม จริยธรรม คุณลักษณะอันพึงประสงค์ และค่านิยมความเป็นไทยที่ดีงาม   โดยริเริ่ม คิดค้น และพัฒนารูปแบบการดำเนินการที่มีประสิทธิภาพ คำนึงถึงความแตกต่างของผู้เรียนเป็นรายบุคคล และสามารถแก้ไขปัญหาและพัฒนาผู้เรียนได้ และเป็นแบบอย่างที่ดีในการอบรมและพัฒนาคุณลักษณะที่ดีของผู้เรียน', 'ชำนาญการพิเศษ', ''),
('ri68cbde8c91bee', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.1', 'จัดทำข้อมูลสารสนเทศของผู้เรียนและรายวิชา', 'มีการริเริ่ม คิดค้น และพัฒนารูปแบบการจัดทำข้อมูลสารสนเทศของผู้เรียนและรายวิชา ให้มีข้อมูลเป็นปัจจุบัน เพื่อใช้ในการส่งเสริมสนับสนุนการเรียนรู้ แก้ไขปัญหาและพัฒนาคุณภาพผู้เรียน และเป็นแบบอย่างที่ดี', 'ชำนาญการพิเศษ', ''),
('ri68cbdea20333f', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.2', 'ดำเนินการตามระบบดูแลช่วยเหลือผู้เรียน', 'มีการใช้ข้อมูลสารสนเทศเกี่ยวกับผู้เรียนรายบุคคลและประสานความร่วมมือกับผู้มีส่วนเกี่ยวข้อง เพื่อพัฒนาและแก้ไขปัญหาผู้เรียน และริเริ่มโครงการหรือจัดกิจกรรมเชิงสร้างสรรค์ด้วยวิธีการที่หลากหลายในการดูแลช่วยเหลือผู้เรียนและเป็นแบบอย่างที่ดี', 'ชำนาญการพิเศษ', ''),
('ri68cbdebb6d341', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.3', 'ปฏิบัติงานวิชาการ และงานอื่น ๆ ของสถานศึกษา ', 'ร่วมปฏิบัติงานทางวิชาการ และงานอื่น ๆ ของสถานศึกษาเพื่อยกระดับคุณภาพการจัดการศึกษาของสถานศึกษา โดยมี การพัฒนารูปแบบหรือแนวทางการดำเนินงานให้  มีประสิทธิภาพสูงขึ้นและเป็นแบบอย่างที่ดี', 'ชำนาญการพิเศษ', ''),
('ri68cbdecf11499', 1, '2.ด้านการส่งเสริมและสนับสนุนการจัดการเรียนรู้', '2.4', 'ประสานความร่วมมือกับผู้ปกครอง ภาคีเครือข่าย และหรือสถานประกอบการ ', 'การประสานความร่วมมือกับผู้ปกครอง ภาคีเครือข่าย และหรือสถานประกอบการ เพื่อร่วมกันแก้ไขปัญหาและพัฒนาผู้เรียน และเป็นแบบอย่างที่ดี', 'ชำนาญการพิเศษ', ''),
('ri68cbdedee4418', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.1', 'พัฒนาตนเองอย่างเป็นระบบและต่อเนื่อง เพื่อให้มีความรู้ ความสามารถ ทักษะ โดยเฉพาะอย่างยิ่ง การใช้ภาษาไทยและภาษาอังกฤษเพื่อการสื่อสาร และการใช้เทคโนโลยีดิจิทัลเพื่อการศึกษา สมรรถนะวิชาชีพครูและความรอบรู้ในเนื้อหาวิชาและวิธีการสอน และเป็นแบบอย่างที่ดี', '', 'ชำนาญการพิเศษ', ''),
('ri68cbdeecc7ea6', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.2', 'มีส่วนร่วม และเป็นผู้นำในการแลกเปลี่ยนเรียนรู้  ทางวิชาชีพ เพื่อแก้ไขปัญหาและสร้างนวัตกรรมเพื่อพัฒนาการจัดการเรียนรู้และเป็นแบบอย่างที่ดี', '', 'ชำนาญการพิเศษ', ''),
('ri68cbdefadfab2', 1, '3.ด้านการพัฒนาตนเองและวิชาชีพ', '3.3', 'นำความรู้ ความสามารถ ทักษะที่ได้จากการพัฒนาตนเองและวิชาชีพมาใช้ในการพัฒนาการจัดการเรียนรู้ การพัฒนาคุณภาพผู้เรียน รวมถึงการพัฒนานวัตกรรมการจัดการเรียนรู้ที่มีผลต่อคุณภาพผู้เรียน และเป็นแบบอย่างที่ดี', '', 'ชำนาญการพิเศษ', '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_rubric_items`
--
ALTER TABLE `tb_rubric_items`
  ADD PRIMARY KEY (`ri_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
