app/Controllers/ConAdminWorkPerson.php

    public function PersonnelGet($id){
        $session = session();
        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');

        $data = $DBPers->select('*')
        ->join('tb_personnel_addresses','tb_personnel_addresses.pers_id = tb_personnel.pers_id','left')
        ->where('tb_personnel.pers_id',$id)
        ->get()->getResult();
---
SELECT *
FROM `tb_personnel`
LEFT JOIN `tb_personnel_addresses` ON `tb_personnel_addresses`.`pers_id` = `tb_personnel`.`pers_id`
WHERE `tb_personnel`.`pers_id` = 'pers_021'

     public function GetPositionData(){
        $session = session();
        $DB_SKJ = \Config\Database::connect('skj');
        $DBPosi = $DB_SKJ->table('tb_position');

        $positionId = $this->request->getPost('position_id');
        $data = $DBPosi->select('work_id,work_name')
        ->where('tb_position.posi_id',$positionId)
        ->join('skjacth_skj.tb_position_main','skjacth_skj.tb_position_main.posi_id = skjacth_skj.tb_position.p_id')
        ->get()->getResult();
---
SELECT `work_id`, `work_name`
FROM `tb_position`
JOIN `skjacth_skj`.`tb_position_main` ON `skjacth_skj`.`tb_position_main`.`posi_id` = `skjacth_skj`.`tb_position`.`p_id`
WHERE `tb_position`.`posi_id` = 'posi_010'