app/Controllers/ConAdminRoles.php

SELECT `admin_rloes_userid`, `admin_rloes_id`, `admin_rloes_nanetype`, `admin_rloes_status`, `admin_rloes_level`
FROM `tb_admin_rloes`
ORDER BY `admin_rloes_level` ASC
SELECT `pers_id`, `pers_prefix`, `pers_firstname`, `pers_lastname`, `pers_position`, `pers_learning`
FROM `tb_personnel`
WHERE `pers_status` = 'กำลังใช้งาน'
ORDER BY `pers_position` ASC
---
    public function index()
    {
        $data = $this->DataMain();
        $data['title']="จัดการข้อมูลกำหนดสิทธิ์การใช้งาน";
        $DB_Personnel = \Config\Database::connect();
        $tb_admin_rloes = $DB_Personnel->table('tb_admin_rloes');
        $DBPers = $DB_Personnel->table('tb_personnel');

        $data['Manager'] = $tb_admin_rloes->select('admin_rloes_userid,admin_rloes_id,admin_rloes_nanetype,admin_rloes_status,admin_rloes_level')
        ->orderBy('admin_rloes_level','ASC')
        ->get()->getResult();

        $data['NameTeacher'] = $DBPers->select('pers_id,pers_prefix,pers_firstname,pers_lastname,pers_position,pers_learning')
        ->where('pers_status','กำลังใช้งาน')
        ->orderBy('pers_position','ASC')
        ->get()->getResult();