app/Controllers/ConAdminPaConfig.php

SELECT *
FROM `tb_evaluators`
ORDER BY `e_first_name` ASC
SELECT `posi_id`, `posi_name`
FROM `tb_position`
ORDER BY `posi_name` ASC
SELECT `lear_id`, `lear_namethai`
FROM `tb_learning`
ORDER BY `lear_namethai` ASC
SELECT *
FROM `tb_assessor_scope`
---
    public function index()
    {
        $session = session();
        // Check if user is admin (using 'rloes' session variable)
        if (!isset($_SESSION['rloes']) || strpos($_SESSION['rloes'], 'งานประเมิน pa') === false) {
            return redirect()->to(base_url('Admin/Home'))->with('Error', 'คุณไม่มีสิทธิ์เข้าถึงหน้านี้!');
        }

        $data = $this->DataMain(); // Call DataMain to get common data like full_url

        $db_pa_evaluation = \Config\Database::connect('pa_evaluation');

        // Fetch all evaluators (potential assessors)
        $evaluators = $db_pa_evaluation->table('tb_evaluators')
                                  ->orderBy('e_first_name', 'ASC')
                                  ->get()->getResultArray();

        $db_skj = \Config\Database::connect('skj'); // Added missing connection

        // Fetch all positions
        $positions = $db_skj->table('tb_position')
                            ->select('posi_id, posi_name')
                            ->orderBy('posi_name', 'ASC')
                            ->get()->getResultArray();

        // Fetch all learning groups
        $learningGroups = $db_skj->table('tb_learning')
                                 ->select('lear_id, lear_namethai')
                                 ->orderBy('lear_namethai', 'ASC')
                                 ->get()->getResultArray();

        // Fetch existing assessor scopes
        $assessorScopes = $db_pa_evaluation->table('tb_assessor_scope')
                                           ->get()->getResultArray();

SELECT *
FROM `tb_assessor_scope`
SELECT *
FROM `tb_evaluators`
SELECT *
FROM `tb_learning`
SELECT *
FROM `tb_position`
SELECT `posi_id`
FROM `tb_position`
WHERE `posi_name` IN ('ครู','ครูผู้ช่วย','ผู้อำนวยการสถานศึกษา','รองผู้อำนวยการสถานศึกษา')
---
    public function report()
    {
        $session = session();
        if (!isset($_SESSION['rloes']) || strpos($_SESSION['rloes'], 'งานประเมิน pa') === false) {
            return redirect()->to(base_url('Admin/Home'))->with('Error', 'คุณไม่มีสิทธิ์เข้าถึงหน้านี้!');
        }

        $db_default = \Config\Database::connect(); // Default connection
        $db_pa_evaluation = \Config\Database::connect('pa_evaluation');
        $db_skj = \Config\Database::connect('skj');

        // Get current fiscal year
        $current_month = date('m');
        $current_year_ad = date('Y');
        $fiscal_year = ($current_month >= 10) ? $current_year_ad + 1 : $current_year_ad;
        $fiscal_year_be = $fiscal_year + 543;

        // 1. Fetch all necessary lookup tables at once
        $assessor_scopes = $db_pa_evaluation->table('tb_assessor_scope')->get()->getResultArray();
        $all_evaluators = $db_pa_evaluation->table('tb_evaluators')->get()->getResultArray();
        $evaluators_map = array_column($all_evaluators, null, 'e_id');
        $learning_groups_raw = $db_skj->table('tb_learning')->get()->getResultArray();
        $learning_groups = array_column($learning_groups_raw, 'lear_namethai', 'lear_id');
        $positions_raw = $db_skj->table('tb_position')->get()->getResultArray();
        $positions = array_column($positions_raw, 'posi_name', 'posi_id');

        // 2. Get the list of teachers (personnel)
        $teacher_positions = $db_skj->table('tb_position')
                                     ->select('posi_id')
                                     ->whereIn('posi_name', ['ครู', 'ครูผู้ช่วย'])
                                     ->get()->getResultArray();

SELECT *
FROM `tb_personnel`
WHERE `pers_status` = 'กำลังใช้งาน'
AND `pers_position` IN ('posi_001','posi_002','posi_003','posi_005')
ORDER BY `pers_learning` ASC, `pers_firstname` ASC
---

        $personnel_with_names = [];
        if (!empty($teacher_position_ids)) {
            $personnel_raw = $db_default->table('tb_personnel')
                                ->where('pers_status', 'กำลังใช้งาน')
                                ->whereIn('pers_position', $teacher_position_ids)
                                ->orderBy('pers_learning', 'ASC')
                                ->orderBy('pers_firstname', 'ASC')
                                ->get()->getResultArray();

SELECT *
FROM `tb_evaluations`
WHERE `t_id` = 'pers_007'
AND `ev_fiscal_year` = 2568
SELECT *
FROM `tb_evaluator_scores`
WHERE `ev_id` = 'EV_68cbe166c3849'
AND `e_id` = 'e68cbe0df7d8f0'
---
    public function getScores($personId, $evaluatorId)
    {
        $db_default = \Config\Database::connect();
        $db_pa_evaluation = \Config\Database::connect('pa_evaluation');

        // Get current fiscal year
        $current_month = date('m');
        $current_year_ad = date('Y');
        $fiscal_year_be = ($current_month >= 10) ? $current_year_ad + 544 : $current_year_ad + 543;

        // 2. Find the main evaluation record (tb_evaluations)
        $evaluation = $db_pa_evaluation->table('tb_evaluations')
            ->where('t_id', $personId)
            ->where('ev_fiscal_year', $fiscal_year_be)
            ->get()->getRowArray();

        if (!$evaluation) {
            return $this->response->setBody('<div class="alert alert-warning">ไม่พบข้อมูลการประเมินหลักสำหรับบุคลากรนี้ในปีการศึกษานี้</div>');
        }

        // 3. Find the specific evaluator's score summary (tb_evaluator_scores)
        $evaluatorScoreSummary = $db_pa_evaluation->table('tb_evaluator_scores')
            ->where('ev_id', $evaluation['ev_id'])
            ->where('e_id', $evaluatorId)
            ->get()->getRowArray();

SELECT *
FROM `tb_item_scores`
WHERE `es_id` = 'ES_68cbe166c3c63'
---
        }

        // 4. Get all individual item scores (tb_item_scores) for this evaluation
        $itemScoresRaw = $db_pa_evaluation->table('tb_item_scores')
            ->where('es_id', $evaluatorScoreSummary['es_id'])
            ->get()->getResultArray();

SELECT *
FROM `tb_evaluators`
WHERE `e_Username` = 'skj01'
---
    public function addEvaluator()
    {
        $session = session();
        if (!isset($_SESSION['rloes']) || strpos($_SESSION['rloes'], 'งานประเมิน pa') === false) {
            return redirect()->to(base_url('Admin/Home'))->with('Error', 'คุณไม่มีสิทธิ์ดำเนินการนี้!');
        }

        $db_pa_evaluation = \Config\Database::connect('pa_evaluation');
        $table = $db_pa_evaluation->table('tb_evaluators');

        // Basic validation to check if username already exists
        $existingUser = $table->where('e_Username', $this->request->getPost('e_Username'))->get()->getRow();

SELECT *
FROM `tb_rubric_items`
ORDER BY `ri_part` ASC, `ri_item_number` ASC
---
    public function rubricItems()
    {
        $session = session();
        if (!isset($_SESSION['rloes']) || strpos($_SESSION['rloes'], 'งานประเมิน pa') === false) {
            return redirect()->to(base_url('Admin/Home'))->with('Error', 'คุณไม่มีสิทธิ์เข้าถึงหน้านี้!');
        }

        $db_pa_evaluation = \Config\Database::connect('pa_evaluation');
        $rubrics = $db_pa_evaluation->table('tb_rubric_items')
                                    ->orderBy('ri_part', 'ASC')
                                    ->orderBy('ri_item_number', 'ASC')
                                    ->get()->getResultArray();