app/Controllers/ConAdminWorkPerson.php

    public function FormAdd(){
        $session = session();
        $data = $this->DataMain();
        $data['title']="เพิ่มข้อมูลครูและบุคคลทางการศึกษา";
        $DB_SKJ = \Config\Database::connect('skj');
        $DBPosi = $DB_SKJ->table('tb_position');
        $DBLear = $DB_SKJ->table('tb_learning');
        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');

        $data['position'] = $DBPosi->get()->getResult();
        $data['learning'] = $DBLear->get()->getResult();

		$data['pers'] =	$DBPers->orderBy('pers_id','DESC')->get()->getResult();
---
SELECT *
FROM `tb_position`
SELECT *
FROM `tb_learning`
SELECT *
FROM `tb_personnel`
ORDER BY `pers_id` DESC

    public function PersonneViewGroup($Key){
        $session = session();
        $data = $this->DataMain();
        $data['title']="ข้อมูลตามกลุ่ม";

        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');
        $sub = explode("_",$Key);
        if($sub[0] == "posi"){
            $Where = ['pers_position'=>$Key];
            $data['Teach'] = false;
        }elseif($Key === "Executive"){
            $Where = 'pers_position = "posi_001" || pers_position= "posi_002"';
            $data['Teach'] = true;
        }
        else{
            $Where = ['pers_learning'=>$Key];
            $data['Teach'] = true;
        }

        $data["Teacher"] = $DBPers
        ->select('pers_id,pers_prefix,pers_firstname,pers_lastname,pers_img,posi_name,pers_academic')
        ->join('skjacth_skj.tb_position','skjacth_skj.tb_position.posi_id = skjacth_personnel.tb_personnel.pers_position')
        ->where('pers_status',"กำลังใช้งาน")
        ->where($Where)
        ->orderBy('pers_numberGroup','ASC')
        ->get()->getResult();
---
SELECT `pers_id`, `pers_prefix`, `pers_firstname`, `pers_lastname`, `pers_img`, `posi_name`, `pers_academic`
FROM `tb_personnel`
JOIN `skjacth_skj`.`tb_position` ON `skjacth_skj`.`tb_position`.`posi_id` = `skjacth_personnel`.`tb_personnel`.`pers_position`
WHERE `pers_status` = 'กำลังใช้งาน'
AND `pers_learning` = 'lear_003'
ORDER BY `pers_numberGroup` ASC

    public function FormPersonneUpdate($IDPres){
        $session = session();
        $data = $this->DataMain();
        $data['title']="อัพเดตข้อมูลครูและบุคคลทางการศึกษา";
        $DB_SKJ = \Config\Database::connect('skj');
        $DBPosi = $DB_SKJ->table('tb_position');
        $DBLear = $DB_SKJ->table('tb_learning');
        $DBPosiMain = $DB_SKJ->table('tb_position_main');
        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');

        $data['position'] = $DBPosi->get()->getResult();
        $data['learning'] = $DBLear->get()->getResult();


        $data['Pers'] = $DBPers->where('pers_id',$IDPres)->get()->getRow();

         $PosiMain = $DBPosiMain->where('work_id',$data['Pers']->pers_workother_id)
         ->get()->getRow();
         $data['PosiMain'] = $DBPosiMain->where('posi_id',$PosiMain->posi_id ?? "")
         ->get()->getResult();
---
SELECT *
FROM `tb_position`
SELECT *
FROM `tb_learning`
SELECT *
FROM `tb_personnel`
WHERE `pers_id` = 'pers_125'
SELECT *
FROM `tb_position_main`
WHERE `work_id` = '1'
SELECT *
FROM `tb_position_main`
WHERE `posi_id` = '7'

    public function PersonneUpdateDataPersonnel(){
        $session = session();
        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');
        $data = [
            'pers_status' => $this->request->getVar('pers_status'),
            'pers_prefix' => $this->request->getVar('pers_prefix'),
            'pers_firstname' => $this->request->getVar('pers_firstname'),
            'pers_lastname' => $this->request->getVar('pers_lastname'),
            'pers_username' => $this->request->getVar('pers_username'),
            'pers_phone' => $this->request->getVar('pers_phone'),
            'pers_position' => $this->request->getVar('pers_position'),
            'pers_learning' => $this->request->getVar('pers_learning'),
            'pers_academic' => $this->request->getVar('pers_academic'),
            'pers_groupleade' => $this->request->getVar('pers_groupleade'),
            'pers_workother_id' => $this->request->getVar('pers_workother_id') ?? "",
        ];
        $DBPers->where('pers_id', $this->request->getVar('pers_id'));
        echo $DBPers->update($data);
---
UPDATE `tb_personnel` SET `pers_status` = 'กำลังใช้งาน', `pers_prefix` = 'ว่าที่ร้อยตรี', `pers_firstname` = 'วชิรวิทย์', `pers_lastname` = 'แกล้วการไถ', `pers_username` = 'dekpiano@skj.ac.th', `pers_phone` = '09-1051-8473', `pers_position` = 'posi_006', `pers_learning` = 'lear_003', `pers_academic` = '', `pers_groupleade` = ''
WHERE `pers_id` = 'pers_021'

    public function PersonnelGet($id){
        $session = session();
        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');

        $data = $DBPers->select('*')
        ->join('tb_personnel_addresses','tb_personnel_addresses.pers_id = tb_personnel.pers_id','left')
        //->join('tb_position','tb_position.posi_id = tb_personnel.pers_position','left')
        ->join('skjacth_skj.tb_position_main','tb_position_main.work_id = tb_personnel.pers_workother_id','left')
        ->where('tb_personnel.pers_id',$id)
        ->get()->getResult();
---
SELECT *
FROM `tb_personnel`
LEFT JOIN `tb_personnel_addresses` ON `tb_personnel_addresses`.`pers_id` = `tb_personnel`.`pers_id`
LEFT JOIN `skjacth_skj`.`tb_position_main` ON `tb_position_main`.`work_id` = `tb_personnel`.`pers_workother_id`
WHERE `tb_personnel`.`pers_id` = 'pers_125'

     public function GetPositionData(){
        $session = session();
        $DB_SKJ = \Config\Database::connect('skj');
        $DBPosi = $DB_SKJ->table('tb_position');

        $positionId = $this->request->getPost('position_id');
        $data = $DBPosi->select('work_id,work_name')
        ->where('tb_position.posi_id',$positionId)
        ->join('skjacth_skj.tb_position_main','skjacth_skj.tb_position_main.posi_id = skjacth_skj.tb_position.p_id')
        ->get()->getResult();
---
SELECT `work_id`, `work_name`
FROM `tb_position`
JOIN `skjacth_skj`.`tb_position_main` ON `skjacth_skj`.`tb_position_main`.`posi_id` = `skjacth_skj`.`tb_position`.`p_id`
WHERE `tb_position`.`posi_id` = 'posi_008'

     public function PersonnelUpdateAlone(){
        $session = session();
        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');
        $DBPersAddr = $DB_Personnel->table('tb_personnel_addresses');

        $field = $this->request->getVar('field');
        $value = $this->request->getVar('value');

        $Ex = explode("_",$field);

        if($Ex[0] === "curr"){
            $CheckPresID = $DBPersAddr->select('pers_id')
            ->where('addr_type',"ปัจจุบัน")
            ->where('pers_id',$this->request->getVar('PresID'))->get()->getRow();

            if (str_starts_with($field, 'curr_') && str_contains($field, 'addr_')) {
                $fieldNew = str_replace('curr_', '', $field);
            }

            if($CheckPresID){
                //print_r(($fieldNew)); exit();
                $DBPersAddr->where('pers_id', $this->request->getVar('PresID'));
                $DBPersAddr->where('addr_type',"ปัจจุบัน");
                $DBPersAddr->update([$fieldNew => $value]);
---
SELECT `pers_id`
FROM `tb_personnel_addresses`
WHERE `addr_type` = 'ปัจจุบัน'
AND `pers_id` = 'pers_021'
SELECT `pers_id`
FROM `tb_personnel_addresses`
WHERE `addr_type` = 'ทะเบียนบ้าน'
AND `pers_id` = 'pers_130'
UPDATE `tb_personnel` SET `pers_nationality` = 'ไทย'
WHERE `pers_id` = 'pers_021'
UPDATE `tb_personnel_addresses` SET `addr_district` = 'เมืองนครสวรรค์'
WHERE `pers_id` = 'pers_021'
AND `addr_type` = 'ปัจจุบัน'