app/Controllers/ConUserPaEvaluation.php

    public function paPersonnelList()
    {
        $session = session();
        $data = $this->DataMain();
        if (!$session->get('logged_in')) {
            return redirect()->to(base_url('pa-login?return_to=pa-personnel'));
        }
        $db_personnel = \Config\Database::connect('personnel');
        $builder = $db_personnel->table('tb_personnel');

        // Connect to the second database for joins
        $db_skj = \Config\Database::connect('skj');
        $db_pa_evaluation = \Config\Database::connect('pa_evaluation');

        // Perform joins with tables from the second database
        $builder->join($db_skj->getDatabase() . '.tb_position', 'tb_position.posi_id = tb_personnel.pers_position', 'left');
        $builder->join($db_skj->getDatabase() . '.tb_learning', 'tb_learning.lear_id = tb_personnel.pers_learning', 'left');

                $builder->where('tb_personnel.pers_status', "กำลังใช้งาน"); // Note: Assuming pers_status stores string "กำลังใช้งาน", if it's an integer (e.g., 1), this might not work as expected.

        // --- Start Assessor Scope Filtering ---
        $loggedInUserId = $session->get('id'); // Get the e_id of the logged-in user (assessor)

        // Fetch scopes for the logged-in assessor
        $assessorScopes = $db_pa_evaluation->table('tb_assessor_scope')
                                           ->where('assessor_e_id', $loggedInUserId)
                                           ->get()->getResultArray();
---
SELECT *
FROM `tb_assessor_scope`
WHERE `assessor_e_id` = 'e68d1132cc62a9'

        $loggedInUserId = $session->get('id'); // e_id from tb_evaluators

        foreach ($personnel as &$p) { // ใช้ & เพื่อแก้ไขค่าใน array โดยตรง
            $evaluationExists = $db_pa_evaluation->table('tb_evaluator_scores')
                                                 ->join('tb_evaluations', 'tb_evaluations.ev_id = tb_evaluator_scores.ev_id')
                                                 ->where('tb_evaluations.t_id', $p['pers_id'])
                                                 ->where('tb_evaluator_scores.e_id', $loggedInUserId)
                                                 ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `tb_evaluator_scores`
JOIN `tb_evaluations` ON `tb_evaluations`.`ev_id` = `tb_evaluator_scores`.`ev_id`
WHERE `tb_evaluations`.`t_id` = 'pers_004'
AND `tb_evaluator_scores`.`e_id` = 'e68d1132cc62a9'

    public function paForm($personId = null)
    {
        $database = \Config\Database::connect(); // Connects to 'default' (personnel) database
        $db_pa_evaluation = \Config\Database::connect('pa_evaluation'); // Connects to 'pa_evaluation' database
        $db_skj = \Config\Database::connect('skj');

        // Fetch person details
        $builder = $database->table('tb_personnel');
        $builder->join($db_skj->getDatabase() . '.tb_position', 'tb_position.posi_id = tb_personnel.pers_position', 'left');
        $person = $builder->where('pers_id', $personId)->get()->getRowArray();
---
SELECT *
FROM `tb_personnel`
LEFT JOIN `skjacth_skj`.`tb_position` ON `tb_position`.`posi_id` = `tb_personnel`.`pers_position`
WHERE `pers_id` = 'pers_005'

        // --- Query for Part 2 (generic for all) ---
        $part2Builder = $db_pa_evaluation->table('tb_rubric_items');
        $part2Builder->where('ri_part', 2);
        $part2Items = $part2Builder->get()->getResultArray();
---
SELECT *
FROM `tb_rubric_items`
WHERE `ri_part` = 2


        $session = session();
        $evaluatorId = $session->get('id');
        $evaluator = $db_pa_evaluation->table('tb_evaluators')->where('e_id', $evaluatorId)->get()->getRowArray();
---
SELECT *
FROM `tb_evaluators`
WHERE `e_id` = 'e68d1132cc62a9'

        log_message('debug', 'Evaluator data fetched: ' . json_encode($evaluator));

        // ดึงข้อมูลการประเมินล่าสุดสำหรับ personId นี้
        $latestEvaluation = $db_pa_evaluation->table('tb_evaluations')
                                             ->where('t_id', $personId)
                                             ->orderBy('ev_id', 'DESC') // สมมติว่า ev_id ที่สร้างด้วย uniqid จะเรียงตามเวลาได้
                                             ->get()->getRowArray();
---
SELECT *
FROM `tb_evaluations`
WHERE `t_id` = 'pers_005'
ORDER BY `ev_id` DESC